saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM41x_M4_DFP.1.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>AnalogDevices</vendor>
  <name>CM41x_M4_DFP</name>
  <url>http://download.analog.com/tools/EZBoards/CM41x/Releases/</url>
  <description>Analog Devices ARM Cortex-M4 CM41x Family Device Support</description>

  <releases>
    <release version="1.0.0">
      First Release version of CM41x Device Family Pack.
    </release>
  </releases>
  <license>License/2016-03-29-CM41xKP Click Thru SLA.rtf</license>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Analog Devices</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Analog Devices</keyword>
    <keyword>CM41x</keyword>
  </keywords>

  <devices>
    <!-- generated, do not modify this section! -->

    <family Dfamily="CM41x Mixed Signal Control Processors" Dvendor="Analog Devices:1">
      <description>
The ADSP-CM41x Mixed Signal Control Processors utilize the ARM Cortex M4 processor core
integrated with high precision ADCs, digital accelerators and filters, SRAM and flash
memories and a rich set of peripherals.
      </description>


      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <!-- ************************  Subfamily 'CM41x_M4'  **************************** -->
      <subFamily DsubFamily="CM41x_M4">
        <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian" Dclock="240000000"/>
        <description>
            The ADSP-CM41x Mixed Signal Control Processors utilize the ARM Cortex M4 processor core
            integrated with high precision ADCs, digital accelerators and filters, SRAM and flash
            memories and a rich set of peripherals.
            Use this for CM41x support
        </description>
        <compile header="Device/inc/M4/CM41x_M4_device.h"/>
        <debug svd="SVD/CM41x_M4.svd"/>
        <feature type="VCC"          n="3.13"   m="3.47"/>
        <feature type="Temp"         n="-40"    m="105"        name="Extended Operating Temperature Range"/>
        <!-- *************************  Device 'ADSP-CM41_M4'  ***************************** -->
        <device Dname="ADSP-CM419F-BCZ_M4">
          <memory  id="IROM1"  start="0x11000000"  size="0x00001000"  startup="1"   default="1"/>
          <memory  id="IROM2"  start="0x11001000"  size="0x000FF000"  startup="0"   default="1"/>
          <memory  id="IRAM1"  start="0x10000000"  size="0x00010000"  init   ="1"   default="1"/>
          <memory  id="IRAM2"  start="0x20010000"  size="0x00018000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/CM41x_FlashA_512.FLM"  start="0x11000000"  size="0x00080000"  RAMstart="0x10008000"  RAMsize="0x10000"  default="1"/>
          <algorithm  name="Flash/CM41x_FlashB_512.FLM"  start="0x11080000"  size="0x00080000"  RAMstart="0x10008000"  RAMsize="0x10000"  default="0"/>
        </device>
      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- conditions are dependecy rules that can apply to a component or an individual file -->
    <condition id="Compiler ARM">
      <!-- conditions selecting ARM Compiler -->
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="CM41x Device">
      <description>Analog Devices CM41x devices</description>
      <require Dvendor="Analog Devices:1"  Dname="ADSP-CM419F-BCZ_M4" />
    </condition>

    <condition id="CM41x CMSIS Device">
      <!-- conditions selecting Devices -->
      <description>Analog Devices CM41x devices and CMSIS-CORE</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept condition="CM41x Device"/>
    </condition>

	<condition id="CM41x Device + OS">
	  <require condition="CM41x CMSIS Device"/>
	  <require Cclass="Device" Cgroup="RTOS" Csub="no OS"/>
	</condition>
	
	<condition id="CM41x Device + Services">
	  <require condition="CM41x CMSIS Device"/>
	  <require Cclass="Device" Cgroup="Services Library"/>
	</condition>
	
  </conditions>

  <taxonomy>
    <description Cclass="Device" Cgroup="OSAL" doc="Documents/html/index.html" >Analog Devices OS (no OS) component for CM41x Devices</description>
    <description Cclass="Device" Cgroup="Services" doc="Documents/html/index.html" >Analog Devices Services component for CM41x Devices</description>
    <description Cclass="Device" Cgroup="Drivers" doc="Documents/html/index.html" >Analog Devices driver components for CM41x Devices</description>
  </taxonomy>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="CM41x CMSIS Device">
      <!-- Cversion is necessary -->
      <description>System Startup for Analog Devices CM41x device series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
      </RTE_Components_h>

      <files>
        <!-- header path -->
        <file category="include" name="Device/inc/M4/"                  condition="CM41x Device"/>
        <file category="header"  name="Device/inc/M4/CM41x_M4_device.h" condition="CM41x Device"/>

        <!-- startup/system files -->
        <file category="source"  name="Device/src/M4/startup_CM41x_M4.s" attr="config"  condition="Compiler ARM" version="1.0.0"/>
        <file category="source"  name="Device/src/M4/system_CM41x_M4.c"  attr="config"  condition="Compiler ARM" version="1.0.0"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Retarget" Cversion="1.0.0" condition="CM41x Device">
      <description>Retargeting for CM41x Devices</description>
      <files>
        <file category="source" name="Device/src/Retarget.c"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="Interrupt" Cversion="1.0.0" condition="CM41x Device">
      <description>Interrupt</description>
      <files>
        <file category="source" name="Device/src/services/int/adi_int.c"/>
        <file category="source" name="Device/src/services/int/adi_nvic.c"/>
        <file category="header" name="Device/inc/services/int/adi_int.h"/>
        <file category="header" name="Device/inc/adi_nvic.h"/>
        <file category="doc" name="Documents/html/group___i_n_t_e_r_r_u_p_t_s.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="Power" Cversion="1.0.0" condition="CM41x Device">
      <description>Power</description>
      <files>
        <file category="source" name="Device/src/services/pwr/adi_pwr.c"/>
        <file category="header" name="Device/inc/services/pwr/adi_pwr.h"/>
        <file category="doc" name="Documents/html/group___power___service.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="DMA" Cversion="1.0.0" condition="CM41x Device">
      <description>DMA </description>
      <files>
        <file category="source" name="Device/src/services/dma/adi_dma.c"/>
        <file category="header" name="Device/inc/services/dma/adi_dma.h"/>
        <file category="doc" name="Documents/html/group___d_m_a___manager.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="TRU" Cversion="1.0.0" condition="CM41x Device">
      <description>TRU </description>
      <files>
        <file category="source" name="Device/src/services/tru/adi_tru.c"/>
        <file category="header" name="Device/inc/services/tru/adi_tru.h"/>
        <file category="doc" name="Documents/html/group___t_r_u___manager.html"/>
      </files>
    </component>
    

    <component Cclass="Device" Cgroup="Services" Csub="SMPU" Cversion="1.0.0" condition="CM41x Device">
      <description>SMPU </description>
      <files>
        <file category="source" name="Device/src/services/smpu/adi_smpu.c"/>
        <file category="header" name="Device/inc/services/smpu/adi_smpu.h"/>
        <file category="doc" name="Documents/html/group___s_m_p_u___service.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="Timer" Cversion="1.0.0" condition="CM41x Device">
      <description>Timer</description>
      <files>
        <file category="source" name="Device/src/services/tmr/adi_tmr.c"/>
        <file category="header" name="Device/inc/services/tmr/adi_tmr.h"/>
        <file category="doc" name="Documents/html/group___timer___service.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Services" Csub="GPIO" Cversion="1.0.0" condition="CM41x Device">
      <description>GPIO</description>
      <files>
        <file category="source" name="Device/src/services/gpio/adi_gpio.c"/>
        <file category="header" name="Device/inc/services/gpio/adi_gpio.h"/>
        <file category="doc" name="Documents/html/group___g_p_i_o___service.html"/>
      </files>
    </component>

