saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM41x_M4_DFP.1.0.0.pdsc
    <component Cclass="Device" Cgroup="Services" Csub="MBOX" Cversion="1.0.0" condition="CM41x Device">
      <description>MBOX</description>
      <files>
        <file category="source" name="Device/src/services/mbox/adi_mbox.c"/>
        <file category="header" name="Device/inc/services/mbox/adi_mbox.h"/>
        <file category="doc" name="Documents/html/group___m_b_o_x___manager.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Services" Csub="PWM" Cversion="1.0.0" condition="CM41x Device">
      <description>PWM</description>
      <files>
        <file category="source" name="Device/src/services/pwm/adi_pwm.c"/>
        <file category="header" name="Device/inc/services/pwm/adi_pwm.h"/>
        <file category="doc" name="Documents/html/group___p_w_m___service.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="ADCC" Cversion="1.0.0" condition="CM41x Device">
      <description>ADCC</description>
      <files>
        <file category="source" name="Device/src/drivers/adcc/adi_adcc.c"/>
        <file category="header" name="Device/inc/drivers/adcc/adi_adcc.h"/>
        <file category="doc" name="Documents/html/group___a_d_c_c___driver.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="DACC" Cversion="1.0.0" condition="CM41x Device">
      <description>DACC</description>
      <files>
        <file category="source" name="Device/src/drivers/dacc/adi_dacc.c"/>
        <file category="header" name="Device/inc/drivers/dacc/adi_dacc.h"/>
        <file category="doc" name="Documents/html/group___d_a_c_c___driver.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.0" condition="CM41x Device">
      <description>SPI</description>
      <files>
        <file category="source" name="Device/src/drivers/spi/adi_spi.c"/>
        <file category="header" name="Device/inc/drivers/spi/adi_spi.h"/>
        <file category="doc" name="Documents/html/group___s_p_i___driver.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="TTU" Cversion="1.0.0" condition="CM41x Device">
      <description>TTU</description>
      <files>
        <file category="source" name="Device/src/drivers/ttu/adi_ttu.c"/>
        <file category="header" name="Device/inc/drivers/ttu/adi_ttu.h"/>
        <file category="doc" name="Documents/html/group___t_t_u___driver.html"/>
      </files>
    </component>    

    <component Cclass="Device" Cgroup="Drivers" Csub="VMU" Cversion="1.0.0" condition="CM41x Device">
      <description>VMU</description>
      <files>
        <file category="source" name="Device/src/drivers/vmu/adi_vmu.c"/>
        <file category="header" name="Device/inc/drivers/vmu/adi_vmu.h"/>
        <file category="doc" name="Documents/html/group___v_m_u___driver.html"/>
      </files>
    </component>    
    
    <component Cclass="Device" Cgroup="Drivers" Csub="CRC" Cversion="1.0.0" condition="CM41x Device">
      <description>CRC</description>
      <files>
        <file category="source" name="Device/src/drivers/crc/adi_crc.c"/>
        <file category="header" name="Device/inc/drivers/crc/adi_crc.h"/>
        <file category="doc" name="Documents/html/group___c_r_c___driver.html"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="Drivers" Csub="MATH UNIT" Cversion="1.0.0" condition="CM41x Device">
      <description>MATH UNIT</description>
      <files>
        <file category="source" name="Device/src/drivers/math_unit/adi_math.c"/>
        <file category="header" name="Device/inc/drivers/math_unit/adi_math.h"/>
        <file category="doc" name="Documents/html/group___m_a_t_h___driver.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="SPORT" Cversion="1.0.0" condition="CM41x Device">
      <description>SPORT</description>
      <files>
        <file category="source" name="Device/src/drivers/sport/adi_sport.c"/>
        <file category="header" name="Device/inc/drivers/sport/adi_sport.h"/>
        <file category="doc" name="Documents/html/group___s_p_o_r_t___driver.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="UART" Cversion="1.0.0" condition="CM41x Device">
      <description>UART</description>
      <files>
        <file category="source" name="Device/src/drivers/uart/adi_uart.c"/>
        <file category="header" name="Device/inc/drivers/uart/adi_uart.h"/>
        <file category="doc" name="Documents/html/group___u_a_r_t___driver.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="TWI" Cversion="1.0.0" condition="CM41x Device">
      <description>TWI</description>
      <files>
        <file category="source" name="Device/src/drivers/twi/adi_twi.c"/>
        <file category="header" name="Device/inc/drivers/twi/adi_twi.h"/>
        <file category="doc" name="Documents/html/group___t_w_i___driver.html"/>
      </files>
    </component>
    
    <component Cclass="Device" Cgroup="Drivers" Csub="Flash" Cversion="1.0.0" condition="CM41x Device">
      <description>Flash</description>
      <files>
        <file category="source" name="Device/src/drivers/flash/adi_flash.c"/>
        <file category="header" name="Device/inc/drivers/flash/adi_flash.h"/>
        <file category="doc" name="Documents/html/group___f_l_a_s_h___driver___c_m41x.html"/>
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="Drivers" Csub="LCD" Cversion="1.0.0" condition="CM41x Device">
      <description>LCD</description>
      <files>
        <file category="source" name="Device/src/drivers/lcd/adafruit/adi_ili9340.c"/>
	    <file category="source" name="Device/src/drivers/lcd/adafruit/adi_ili9340_def.h"/>
        <file category="header" name="Device/inc/drivers/lcd/adafruit/adi_ili9340.h"/>
        <file category="doc" name="Documents/html/group___l_c_d___i_l_i9340.html"/>
      </files>
    </component>
    
