saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/AnalogDevices.CM41x_M4_DFP.1.0.0.pdsc
    <!-- SysTick -->
    <example name="SysTick" doc="readme.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/SysTick" version="1.0.0">
      <description>SysTick test</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/SysTick.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="Interrupt"/>
      </attributes>
    </example>
    
    <example name="SysTick-NoFlash" doc="readme.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/SysTick" version="1.0.0">
      <description>SysTick test(running on RAM)</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4-NoFlash/Systick_M4_NoFlash.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="Interrupt"/>
      </attributes>
    </example>
    
    <!-- Timer -->
    <example name="Timer_Callback" doc="Readme_timer_with_callback.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/timers/Timer_Callback" version="1.0.0">
      <description>timer with callback</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/timer_with_callback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="Timer"/>
      </attributes>
    </example>
    
    <!-- MATH UNIT -->    
    <example name="math functions" doc="Readme_math_functions.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/math_unit/math_functions" version="1.0.0">
      <description>math functions</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/math_unit.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="MATH UNIT"/>
      </attributes>
    </example>
    
    <!-- TRU -->
    <example name="SwTriggerMemDma" doc="Readme_SwTriggerMemDma.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/tru/SwTriggerMemDma" version="1.0.0">
      <description>SwTriggerMemDma</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/tru.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="TRU"/>
      </attributes>
    </example>

    <!-- TTU -->
    <example name="trigger_chain" doc="Readme_ttu_trigger_chain.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/ttu/trigger_chain" version="1.0.0">
      <description>trigger_chain</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/ttu.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="TTU"/>
      </attributes>
    </example>

    <!-- UART -->
    <example name="UART loopback" doc="Readme_uart_loopback.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/uart/loopback" version="1.0.0">
      <description>UART loopback</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/uart_loopback.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="UART"/>
      </attributes>
    </example>
    
    <!-- MBOX -->
    <example name="Mbox Example" doc="Readme_Mbox_Example.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/mbox/Mbox_Example" version="1.0.0">
      <description>Mbox Example</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/Mbox_Example_M4.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="MBOX"/>
      </attributes>
    </example>
	
	<!-- Mbox_SemaMutex -->
    <example name="Mbox_SemaMutex" doc="Readme_Mbox_SemaMutex.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/mbox/Mbox_SemaMutex" version="1.0.0">
      <description>Mbox_SemaMutex</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/Mbox_SemaMutex_M4.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="MBOX"/>
      </attributes>
    </example>

    <!-- PWM -->
    <example name="PWM Servo" doc="Readme_PWM_Servo.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/pwm/PWM_Servo" version="1.0.0">
      <description>PWM Servo</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4/pwm_servo.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Services" Csub="PWM"/>
      </attributes>
    </example>

    <!-- ProgramInfoSpace -->
    <example name="ProgramInfoSpace" doc="Readme_ProgramInfoSpace.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/ProgramInfoSpace" version="1.0.0">
      <description>ProgramInfoSpace</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="report/M4/report.uvprojx"/>
      </project>
      <attributes>
        <keyword>Security</keyword>
        <keyword>Configuration</keyword>
        <category>Getting Started</category>
      </attributes>
    </example>
	
	<!-- LCD -->
    <example name="lcd_graphics" doc="Readme_lcd_graphics.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/lcd/adafruit1480/lcd_graphics" version="1.0.0">
      <description>lcd_graphics</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4\lcd_graphics.uvprojx"/>
      </project>
      <attributes>
        <category>Getting Started</category>
        <component Cclass="Device" Cgroup="Drivers" Csub="LCD"/>
      </attributes>
    </example>
	
	<example name="lcd_text" doc="Readme_lcd_text.txt" folder="Boards/AnalogDevices/ADSP-CM419x-EZ-BOARD/lcd/adafruit1480/lcd_text" version="1.0.0">
      <description>lcd_text</description>
      <board name="ADSP-CM419F EZ-BOARD M4" vendor="AnalogDevices" Dname="ADSP-CM419F-BCZ_M4"/>
      <project>
        <environment name="uv" load="M4\lcd_text.uvprojx"/>
      </project>
    <attributes>
      <category>Getting Started</category>
      <component Cclass="Device" Cgroup="Drivers" Csub="LCD"/>
    </attributes>
  </example>
    
  </examples>

</package>

